In [1]:
import pandas as pd
import numpy as np

In [2]:
a=np.random.random((10,4))
a

array([[0.51428701, 0.2452691 , 0.09699636, 0.99074598],
       [0.06385897, 0.35430594, 0.33395864, 0.55302051],
       [0.34489968, 0.00872654, 0.66905954, 0.56274696],
       [0.29800612, 0.02451886, 0.25726324, 0.29646685],
       [0.00189141, 0.95530337, 0.48861179, 0.52625422],
       [0.28004102, 0.01536884, 0.87258984, 0.1091673 ],
       [0.61123775, 0.55142491, 0.34441874, 0.85509116],
       [0.64919145, 0.97578325, 0.54598943, 0.22877367],
       [0.68320764, 0.43022031, 0.41031001, 0.06912995],
       [0.89261216, 0.5338141 , 0.45200122, 0.66205598]])

In [3]:
x=pd.DataFrame(a, columns=['uno', 'dos', 'tres', 'cuatro'])
x

        uno       dos      tres    cuatro
0  0.514287  0.245269  0.096996  0.990746
1  0.063859  0.354306  0.333959  0.553021
2  0.344900  0.008727  0.669060  0.562747
3  0.298006  0.024519  0.257263  0.296467
4  0.001891  0.955303  0.488612  0.526254
5  0.280041  0.015369  0.872590  0.109167
6  0.611238  0.551425  0.344419  0.855091
7  0.649191  0.975783  0.545989  0.228774
8  0.683208  0.430220  0.410310  0.069130
9  0.892612  0.533814  0.452001  0.662056

In [4]:
x['tres']

0    0.096996
1    0.333959
2    0.669060
3    0.257263
4    0.488612
5    0.872590
6    0.344419
7    0.545989
8    0.410310
9    0.452001
Name: tres, dtype: float64

In [6]:
type(x.tres)

pandas.core.series.Series

In [7]:
type(x)

pandas.core.frame.DataFrame

In [8]:
hoteles=pd.DataFrame({'nombre':['Palace', 'Ritz', 'Pension Loli'],
                      'stars':[5,5,1], 'Precio':[800, 900, 60]})

In [9]:
hoteles

         nombre  stars  Precio
0        Palace      5     800
1          Ritz      5     900
2  Pension Loli      1      60

In [10]:
hoteles.dtypes

nombre    object
stars      int64
Precio     int64
dtype: object

In [11]:
hoteles.shape

(3, 3)

In [12]:
hoteles['Ratio']=hoteles.stars/hoteles.Precio
hoteles

         nombre  stars  Precio     Ratio
0        Palace      5     800  0.006250
1          Ritz      5     900  0.005556
2  Pension Loli      1      60  0.016667

In [13]:
hoteles.T

              0           1             2
nombre   Palace        Ritz  Pension Loli
stars         5           5             1
Precio      800         900            60
Ratio   0.00625  0.00555556     0.0166667

In [14]:
hoteles.sum()

nombre    PalaceRitzPension Loli
stars                         11
Precio                      1760
Ratio                  0.0284722
dtype: object

In [15]:
hoteles.max()

nombre         Ritz
stars             5
Precio          900
Ratio     0.0166667
dtype: object

In [17]:
type(hoteles.min())

pandas.core.series.Series

In [18]:
hoteles.mean()

stars       3.666667
Precio    586.666667
Ratio       0.009491
dtype: float64

In [19]:
hoteles.describe()

          stars      Precio     Ratio
count  3.000000    3.000000  3.000000
mean   3.666667  586.666667  0.009491
std    2.309401  458.839115  0.006224
min    1.000000   60.000000  0.005556
25%    3.000000  430.000000  0.005903
50%    5.000000  800.000000  0.006250
75%    5.000000  850.000000  0.011458
max    5.000000  900.000000  0.016667

In [25]:
hoteles.describe().T['min']

stars      1.000000
Precio    60.000000
Ratio      0.005556
Name: min, dtype: float64

In [26]:
pd.read_csv('data/alumnos.csv')

  Nombre  Edad
0   Pepe    10
1   Juan    20
2   Luis    25
3   Fran  15xº

In [27]:
pd.read_json('data/alumnos.json')

  nombre  edad                                          aficiones
0   Pepe    10  [{'name': 'Beisbol', 'level': 2}, {'name': 'Fu...

In [28]:
from pandas.io.json import json_normalize

In [39]:
df_json=pd.read_json('data/alumnos.json')
#json_normalize('data/alumnos.json')

In [34]:
df_json.aficiones[0]

[{'name': 'Beisbol', 'level': 2},
 {'name': 'Futbol', 'level': 1},
 {'name': 'Esgrima', 'level': 10}]

In [36]:
df2=pd.DataFrame()
for e in df_json.aficiones[0]:
    df2=df2.append(e, ignore_index=True)

In [37]:
df2

   level     name
0    2.0  Beisbol
1    1.0   Futbol
2   10.0  Esgrima

In [40]:
df2.to_json('alumnos_export.json', orient='records')

In [41]:
!pip3 install openpyxl

Requirement already satisfied: openpyxl in /Users/data/Library/Python/3.7/lib/python/site-packages (3.0.0)
Requirement already satisfied: jdcal in /Users/data/Library/Python/3.7/lib/python/site-packages (from openpyxl) (1.4.1)
Requirement already satisfied: et-xmlfile in /Users/data/Library/Python/3.7/lib/python/site-packages (from openpyxl) (1.0.1)

In [42]:
df2.to_excel('alumnos_export.xlsx')

In [43]:
import json

In [44]:
a={'nombre':'Pepe', 'Apellido':'Garcia'}
b=json.dumps(a)

In [46]:
type(a)

dict

In [48]:
type(b)

str

In [49]:
a['nombre']

'Pepe'

In [51]:
b[0]

'{'

In [52]:
m=json.loads(b)
m

{'nombre': 'Pepe', 'Apellido': 'Garcia'}

In [53]:
type(m)

dict

In [54]:
import pickle

In [56]:
color={'leon':'amarillo', 'gato':'rojo'}

with open('save.p', 'wb') as f:
    pickle.dump(color, f)
    
    
#pickle.dumps(color, open('save.p', 'wb'))

color2=pickle.load(open('save.p', 'rb'))
color2

{'leon': 'amarillo', 'gato': 'rojo'}

In [57]:
type(color2)

dict

## Cleaning